---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseC
source: html/95cfc9a6-b8d8-1290-ce7a-b43c61cbee96.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseC Property

Circuit Naming by Phase - Phase C Label.

## Syntax (C#)
```csharp
public string CircuitNamePhaseC { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null